gumballs/michael_kempster/wk4d1/mountains_app/app/controllers/mountains_controller.rb

	def show
		@mountain = Mountain.find(params[:id])
---
SELECT  "mountains".* FROM "mountains"  WHERE "mountains"."id" = $1 LIMIT 1  [["id", 0]]

	def edit
		@mountain = Mountain.find(params[:id])
---
SELECT  "mountains".* FROM "mountains"  WHERE "mountains"."id" = $1 LIMIT 1  [["id", 1]]

	def update
		@mountain = Mountain.find(params[:id])
		@mountain.name = params[:mountain][:name]
		@mountain.height = params[:mountain][:height]
		@mountain.country = params[:mountain][:country]
		@mountain.range = params[:mountain][:range]
		@mountain.comments = params[:mountain][:comments]

		if @mountain.save # successful
---
SELECT  "mountains".* FROM "mountains"  WHERE "mountains"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "mountains" SET "name" = $1, "updated_at" = $2 WHERE "mountains"."id" = 1  [["name", "testedited"], ["updated_at", "2014-10-25 04:43:22.054423"]]

	def create
		@mountain = Mountain.new
		@mountain.name = params[:mountain][:name]
		@mountain.height = params[:mountain][:height]
		@mountain.country = params[:mountain][:country]
		@mountain.range = params[:mountain][:range]
		@mountain.comments = params[:mountain][:comments]

		if @mountain.save # successful
---
INSERT INTO "mountains" ("comments", "country", "created_at", "height", "name", "range", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["comments", "test"], ["country", "test"], ["created_at", "2014-10-25 04:43:12.415748"], ["height", "test"], ["name", "test"], ["range", "test"], ["updated_at", "2014-10-25 04:43:12.415748"]]

	def destroy
		@mountain = Mountain.find(params[:id])
		@mountain.destroy
---
SELECT  "mountains".* FROM "mountains"  WHERE "mountains"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "mountains" WHERE "mountains"."id" = $1  [["id", 1]]